tdloe/tms320-rpi-serial/inc/hw_xbar.h
//*****************************************************************************
//
// The following are defines for the bit fields in the XBARCLR2 register
//
//*****************************************************************************
#define XBAR_CLR2_INPUT1          0x1U         // Input Flag Clear for INPUT1
                                               // Signal
#define XBAR_CLR2_INPUT2          0x2U         // Input Flag Clear for INPUT2
                                               // Signal
#define XBAR_CLR2_INPUT3          0x4U         // Input Flag Clear for INPUT3
                                               // Signal
#define XBAR_CLR2_INPUT4          0x8U         // Input Flag Clear for INPUT4
                                               // Signal
#define XBAR_CLR2_INPUT5          0x10U        // Input Flag Clear for INPUT5
                                               // Signal
#define XBAR_CLR2_INPUT7          0x20U        // Input Flag Clear for INPUT7
                                               // Signal
#define XBAR_CLR2_ADCSOCAO        0x40U        // Input Flag Clear for ADCSOCAO
                                               // Signal
#define XBAR_CLR2_ADCSOCBO        0x80U        // Input Flag Clear for ADCSOCBO
                                               // Signal
#define XBAR_CLR2_CLB1_OUT4       0x100U       // Input Flag Clear for
                                               // CLB1_OUT4 Signal
#define XBAR_CLR2_CLB1_OUT5       0x200U       // Input Flag Clear for
                                               // CLB1_OUT5 Signal
#define XBAR_CLR2_CLB2_OUT4       0x400U       // Input Flag Clear for
                                               // CLB2_OUT4 Signal
#define XBAR_CLR2_CLB2_OUT5       0x800U       // Input Flag Clear for
                                               // CLB2_OUT5 Signal
#define XBAR_CLR2_CLB3_OUT4       0x1000U      // Input Flag Clear for
                                               // CLB3_OUT4 Signal
#define XBAR_CLR2_CLB3_OUT5       0x2000U      // Input Flag Clear for
                                               // CLB3_OUT5 Signal
#define XBAR_CLR2_CLB4_OUT4       0x4000U      // Input Flag Clear for
                                               // CLB4_OUT4 Signal
#define XBAR_CLR2_CLB4_OUT5       0x8000U      // Input Flag Clear for
                                               // CLB4_OUT5 Signal
#define XBAR_CLR2_ECAP1_OUT       0x10000U     // Input Flag Clear for
                                               // ECAP1.OUT Signal
#define XBAR_CLR2_ECAP2_OUT       0x20000U     // Input Flag Clear for
                                               // ECAP2.OUT Signal
#define XBAR_CLR2_ECAP3_OUT       0x40000U     // Input Flag Clear for
                                               // ECAP3.OUT Signal
#define XBAR_CLR2_ECAP4_OUT       0x80000U     // Input Flag Clear for
                                               // ECAP4.OUT Signal
#define XBAR_CLR2_ECAP5_OUT       0x100000U    // Input Flag Clear for
                                               // ECAP5.OUT Signal
#define XBAR_CLR2_ECAP6_OUT       0x200000U    // Input Flag Clear for
                                               // ECAP6.OUT Signal
#define XBAR_CLR2_EXTSYNCOUT      0x400000U    // Input Flag Clear for
                                               // EXTSYNCOUT Signal
#define XBAR_CLR2_ADCAEVT1        0x800000U    // Input Flag Clear for ADCAEVT1
                                               // Signal
#define XBAR_CLR2_ADCAEVT2        0x1000000U   // Input Flag Clear for ADCAEVT2
                                               // Signal
#define XBAR_CLR2_ADCAEVT3        0x2000000U   // Input Flag Clear for ADCAEVT3
                                               // Signal
#define XBAR_CLR2_ADCAEVT4        0x4000000U   // Input Flag Clear for ADCAEVT4
                                               // Signal
#define XBAR_CLR2_ADCBEVT1        0x8000000U   // Input Flag Clear for ADCBEVT1
                                               // Signal
#define XBAR_CLR2_ADCBEVT2        0x10000000U  // Input Flag Clear for ADCBEVT2
                                               // Signal
#define XBAR_CLR2_ADCBEVT3        0x20000000U  // Input Flag Clear for ADCBEVT3
                                               // Signal
#define XBAR_CLR2_ADCBEVT4        0x40000000U  // Input Flag Clear for ADCBEVT4
                                               // Signal
#define XBAR_CLR2_ADCCEVT1        0x80000000U  // Input Flag Clear for ADCCEVT1
                                               // Signal

//*****************************************************************************
//
// The following are defines for the bit fields in the XBARCLR3 register
//
//*****************************************************************************
#define XBAR_CLR3_ADCCEVT2        0x1U         // Input Flag Clear for ADCCEVT2
                                               // Signal
#define XBAR_CLR3_ADCCEVT3        0x2U         // Input Flag Clear for ADCCEVT3
                                               // Signal
#define XBAR_CLR3_ADCCEVT4        0x4U         // Input Flag Clear for ADCCEVT4
                                               // Signal
#define XBAR_CLR3_ADCDEVT1        0x8U         // Input Flag Clear for ADCDEVT1
                                               // Signal
#define XBAR_CLR3_ADCDEVT2        0x10U        // Input Flag Clear for ADCDEVT2
                                               // Signal
#define XBAR_CLR3_ADCDEVT3        0x20U        // Input Flag Clear for ADCDEVT3
                                               // Signal
#define XBAR_CLR3_ADCDEVT4        0x40U        // Input Flag Clear for ADCDEVT4
                                               // Signal
#define XBAR_CLR3_SD1FLT1_COMPL   0x80U        // Input Flag Clear for
                                               // SD1FLT1.COMPL Signal
#define XBAR_CLR3_SD1FLT1_COMPH   0x100U       // Input Flag Clear for
                                               // SD1FLT1.COMPH Signal
#define XBAR_CLR3_SD1FLT2_COMPL   0x200U       // Input Flag Clear for
                                               // SD1FLT2.COMPL Signal
#define XBAR_CLR3_SD1FLT2_COMPH   0x400U       // Input Flag Clear for
                                               // SD1FLT2.COMPH Signal
#define XBAR_CLR3_SD1FLT3_COMPL   0x800U       // Input Flag Clear for
                                               // SD1FLT3.COMPL Signal
#define XBAR_CLR3_SD1FLT3_COMPH   0x1000U      // Input Flag Clear for
                                               // SD1FLT3.COMPH Signal
#define XBAR_CLR3_SD1FLT4_COMPL   0x2000U      // Input Flag Clear for
                                               // SD1FLT4.COMPL Signal
#define XBAR_CLR3_SD1FLT4_COMPH   0x4000U      // Input Flag Clear for
                                               // SD1FLT4.COMPH Signal
#define XBAR_CLR3_SD2FLT1_COMPL   0x8000U      // Input Flag Clear for
                                               // SD2FLT1.COMPL Signal
#define XBAR_CLR3_SD2FLT1_COMPH   0x10000U     // Input Flag Clear for
                                               // SD2FLT1.COMPH Signal
#define XBAR_CLR3_SD2FLT2_COMPL   0x20000U     // Input Flag Clear for
                                               // SD2FLT2.COMPL Signal
#define XBAR_CLR3_SD2FLT2_COMPH   0x40000U     // Input Flag Clear for
                                               // SD2FLT2.COMPH Signal
#define XBAR_CLR3_SD2FLT3_COMPL   0x80000U     // Input Flag Clear for
                                               // SD2FLT3.COMPL Signal
#define XBAR_CLR3_SD2FLT3_COMPH   0x100000U    // Input Flag Clear for
                                               // SD2FLT3.COMPH Signal
#define XBAR_CLR3_SD2FLT4_COMPL   0x200000U    // Input Flag Clear for
                                               // SD2FLT4.COMPL Signal
#define XBAR_CLR3_SD2FLT4_COMPH   0x400000U    // Input Flag Clear for
                                               // SD2FLT4.COMPH Signal
#endif
